<template>
    <div>
        <div id="myChart-map3"></div>
        <div class="mobile-show animated slideInRight">
            <div class="top-hr"></div>
            <div class="top-dot"></div>
            <div class="screen">
                <div style="background:white">
                    <div class="catalogue">
                        <h3 style="padding-top: 15px;">新冠肺炎预防知识图谱</h3 s>
                        <small>参考书籍：新型冠状病毒感染的肺炎预防手册</small>
                    </div>
                    <p class="ml">新冠肺炎预防知识图谱 目录</p>
                    <div class="content">
                        <p style="margin-top: 0px;">1、冠状病毒</p>
                        <div class="hr"></div>
                        <p style="margin-top: 0px;">2、传播风险</p>
                        <div class="hr"></div>
                        <p style="margin-top: 0px;">3、发现与治疗</p>
                        <div class="hr"></div>
                        <p style="margin-top: 0px;">4、个人防护措施</p>
                        <div class="hr"></div>
                        <p style="margin-top: 0px;">5、场所卫生要求</p>
                        <div class="hr"></div>
                        <p style="margin-top: 0px;">6、传染病相关知识</p>
                        <div class="hr"></div>
                        <p style="margin-left: 10px;color: #999;">点击图表节点获取其具体信息</p>
                    </div>
                </div>
            </div>
        </div>
    </div>
</template>
<script>
    export default {
        mounted() {
            let graph = {
                links: [{
                    "source": 0,
                    "target": 1
                }, {
                    "source": 0,
                    "target": 2
                }, {
                    "source": 0,
                    "target": 3
                }, {
                    "source": 0,
                    "target": 4
                }, {
                    "source": 0,
                    "target": 5
                }, {
                    "source": 0,
                    "target": 6
                }, {
                    "source": 4,
                    "target": 7
                }, {
                    "source": 4,
                    "target": 8
                }, {
                    "source": 4,
                    "target": 9
                }, {
                    "source": 4,
                    "target": 10
                }, {
                    "source": 4,
                    "target": 11
                }, {
                    "source": 4,
                    "target": 12
                }, {
                    "source": 4,
                    "target": 13
                }, {
                    "source": 4,
                    "target": 14
                }, {
                    "source": 4,
                    "target": 15
                }, {
                    "source": 4,
                    "target": 16
                }, {
                    "source": 4,
                    "target": 17
                }, {
                    "source": 6,
                    "target": 18
                }, {
                    "source": 6,
                    "target": 19
                }, {
                    "source": 6,
                    "target": 20
                }, {
                    "source": 6,
                    "target": 21
                }, {
                    "source": 6,
                    "target": 22
                }, {
                    "source": 6,
                    "target": 23
                }, {
                    "source": 6,
                    "target": 24
                }, {
                    "source": 6,
                    "target": 25
                }, {
                    "source": 6,
                    "target": 26
                }, {
                    "source": 6,
                    "target": 27
                }, {
                    "source": 2,
                    "target": 28
                }, {
                    "source": 2,
                    "target": 29
                }, {
                    "source": 2,
                    "target": 30
                }, {
                    "source": 2,
                    "target": 31
                }, {
                    "source": 2,
                    "target": 32
                }, {
                    "source": 2,
                    "target": 33
                }, {
                    "source": 2,
                    "target": 34
                }, {
                    "source": 2,
                    "target": 35
                }, {
                    "source": 2,
                    "target": 36
                }, {
                    "source": 2,
                    "target": 36
                }, {
                    "source": 3,
                    "target": 37
                }, {
                    "source": 3,
                    "target": 38
                }, {
                    "source": 3,
                    "target": 39
                }, {
                    "source": 3,
                    "target": 40
                }, {
                    "source": 3,
                    "target": 41
                }, {
                    "source": 3,
                    "target": 42
                }, {
                    "source": 3,
                    "target": 43
                }, {
                    "source": 3,
                    "target": 44
                }, {
                    "source": 3,
                    "target": 45
                }, {
                    "source": 3,
                    "target": 46
                }, {
                    "source": 3,
                    "target": 47
                }, {
                    "source": 3,
                    "target": 48
                }, {
                    "source": 5,
                    "target": 49
                }, {
                    "source": 5,
                    "target": 50
                }, {
                    "source": 5,
                    "target": 51
                }, {
                    "source": 5,
                    "target": 52
                }, {
                    "source": 5,
                    "target": 53
                }, {
                    "source": 5,
                    "target": 54
                }, {
                    "source": 5,
                    "target": 55
                }, {
                    "source": 5,
                    "target": 56
                }, {
                    "source": 1,
                    "target": 57
                }, {
                    "source": 1,
                    "target": 58
                }, {
                    "source": 1,
                    "target": 59
                }, {
                    "source": 1,
                    "target": 60
                }, {
                    "source": 1,
                    "target": 61
                }, {
                    "source": 1,
                    "target": 62
                }, {
                    "source": 1,
                    "target": 63
                }],
                nodes: [{
                    "name": "新冠肺炎\n预防知识图谱",
                    "symbolSize": 60,
                    "id": `<div>&nbsp;&nbsp;&nbsp;&nbsp;章节内容涵盖：冠状病毒、传播风险、发现与治疗、发现与治疗、个人防护措施、场所卫生要求、传染病相关知识</div>`
                }, {
                    "name": "传染病相关知识",
                    "symbolSize": 20,
                    "category": '传染病相关知识',
                    "id": `&nbsp;&nbsp;&nbsp;&nbsp;章节内容涵盖：传染病管理、超级传播、医学观察`
                }, {
                    "name": "发现与治疗",
                    "symbolSize": 20,
                    "category": '发现与治疗',
                    "id": `&nbsp;&nbsp;&nbsp;&nbsp;章节内容涵盖：早期临床症状、病例识别、临床治疗`
                }, {
                    "name": "个人防护措施",
                    "symbolSize": 20,
                    "category": '个人防护措施',
                    "id": `&nbsp;&nbsp;&nbsp;&nbsp;章节内容涵盖：洗手、通风、口罩使用、生活指导`
                }, {
                    "name": "冠状病毒",
                    "symbolSize": 20,
                    "category": '冠状病毒',
                    "id": `&nbsp;&nbsp;&nbsp;&nbsp;章节内容涵盖：生物学特点、致病性、传播途径、流行现状`

                }, {
                    "name": "场所卫生要求",
                    "symbolSize": 20,
                    "category": '场所卫生要求',
                    "id": `&nbsp;&nbsp;&nbsp;&nbsp;章节内容涵盖：农贸市场、影剧院、医院等公共场所防护`
                }, {
                    "name": "传播风险",
                    "symbolSize": 20,
                    "category": '传播风险',
                    "id": `&nbsp;&nbsp;&nbsp;&nbsp;章节内容涵盖：社区获得性肺炎、传染源、传播途径、预防`
                }, {
                    "name": "呼吸道病毒简介",
                    "symbolSize": 10,
                    "category": '冠状病毒',
                    "id": `<div>&nbsp;&nbsp;&nbsp;&nbsp;呼吸道病毒（viruses associated with respiratory infection）是指以呼吸道为侵入门户，在呼吸道黏膜上皮细胞中增殖，引起呼吸道局部感染或呼吸道以外组织器官病变的病毒。</div>
                           <img src='../../static/img/hxdbd.jpg'>`
                }, {
                    "name": "常见的呼吸道病毒",
                    "symbolSize": 10,
                    "category": '冠状病毒',
                    "id": `<img src='../../static/img/cjhxdbd1.jpg'>
                          <div>&nbsp;&nbsp;&nbsp;&nbsp;主要包括正黏病毒科的流感病毒，副黏病毒科的副流感病毒、呼吸道合胞病毒、麻疹病毒、腮腺炎病毒、亨德拉病毒、尼帕病毒和人偏肺病毒，披膜病毒科的风疹病毒，小RNA病毒科的鼻病毒，冠状病毒科的SARS冠状病毒等。此外，腺病毒、呼肠病毒、柯萨奇病毒与ECHO病毒、疱疹病毒等也可引起呼吸道感染性疾病。<div>
                          <img src='../../static/img/cjhxdbd2.jpg'>
                          <img src='../../static/img/cjhxdbd3.jpg'>
                          <img src='../../static/img/cjhxdbd4.jpg'>`
                }, {
                    "name": "什么是冠状病毒",
                    "symbolSize": 10,
                    "category": '冠状病毒',
                    "id": `<div>&nbsp;&nbsp;&nbsp;&nbsp;主要包括正黏病毒科的流感病毒，副黏病毒科的副流感病毒、呼吸道合胞病毒、麻疹病毒、腮腺炎病毒、亨德拉病毒、尼帕病毒和人偏肺病毒，披膜病毒科的风疹病毒，小RNA病毒科的鼻病毒，冠状病毒科的SARS冠状病毒等。此外，腺病毒、呼肠病毒、柯萨奇病毒与ECHO病毒、疱疹病毒等也可引起呼吸道感染性疾病。</div>
                          <img src='../../static/img/gzbd.jpg'>`
                }, {
                    "name": "冠状病毒形态与结构",
                    "symbolSize": 10,
                    "category": '冠状病毒',
                    "id": `<div>&nbsp;&nbsp;&nbsp;&nbsp;冠状病毒有包膜，颗粒呈圆形或椭圆形，经常为多形性，直径50～200 nm。新型冠状病毒直径60～140 nm。S蛋白位于病毒表面，形成棒状结构，作为病毒的主要抗原蛋白之一，是用于分型的主要结构，N蛋白包裹病毒基因组，可用作诊断抗原。</div>
                           <img src='../../static/img/xtjg.jpg'>`
                }, {
                    "name": "冠状病毒的分类",
                    "symbolSize": 10,
                    "category": '冠状病毒',
                    "id": `<div>&nbsp;&nbsp;&nbsp;&nbsp;冠状病毒大部分感染动物，目前从人分离的冠状病毒主要有普通冠状病毒229E、OC43和SARS冠状病毒（SARS-CoV）3个型别。以前已知感染人的冠状病毒有6种：α属的229E、NL63，β属的OC43、HKU1、中东呼吸综合征相关冠状病毒（MERS-CoV）、严重急性呼吸综合征相关冠状病毒（SARS-CoV）。最近从武汉市不明原因肺炎病人下呼吸道分离出的一种新型冠状病毒——2019-nCoV。</div>
                           <div>&nbsp;&nbsp;&nbsp;&nbsp;新型冠状病毒（2019-nCoV）与以前发现的6种冠状病毒基因组序列极为相似，基因序列同源性分析，新型冠状病毒与SARS-CoV有很高的相似性，新型冠状病毒目前可以归到β属冠状病毒中。</div>
                           <img src='../../static/img/gzbdfl.jpg'>`
                }, {
                    "name": "会携带冠状病毒\n的野生动物",
                    "symbolSize": 10,
                    "category": '冠状病毒',
                    "id": `<div>&nbsp;&nbsp;&nbsp;&nbsp;很多野生动物都可能携带病原体，成为某些传染病的传播媒介，蝙蝠、果子狸、獾、竹鼠等是冠状病毒的常见宿主。</div>
                           <div>&nbsp;&nbsp;&nbsp;&nbsp;武汉地区暴发的新型冠状病毒感染的肺炎疫情，与2003年广东暴发的SARS疫情有很多相似之处，都发生在冬季，初始发生都起源于人与动物交易市场的鲜活动物接触，而且都是由未知的冠状病毒导致。</div>
                           <img src='../../static/img/hxdysdw.jpg'>
                           <div>&nbsp;&nbsp;&nbsp;&nbsp;由于新型冠状病毒与蝙蝠体内的一种冠状病毒序列一致性高达85%以上，推测新型冠状病毒的自然宿主也可能是蝙蝠。如同导致2003年暴发的SARS冠状病毒一样，新型冠状病毒在从蝙蝠到人的传播过程中很可能存在未知的中间宿主媒介。</div>`
                }, {
                    "name": "如何由动物传到人",
                    "symbolSize": 10,
                    "category": '冠状病毒',
                    "id": `<div>&nbsp;&nbsp;&nbsp;&nbsp;新型冠状病毒、SARS-CoV的病毒类群都为蝙蝠中的冠状病毒HKU9-1，而许多与冠状病毒有联系的人类感染冠状病毒都和蝙蝠有关，许多冠状病毒的天然宿主都是蝙蝠。蝙蝠很有可能就是新型冠状病毒的原生宿主，经过演化变异，完成了蝙蝠-中间宿主-人的传播。基因组序列同源性分析显示新型冠状病毒与蝙蝠体内的一种冠状病毒的同源性为85%以上。不过，从蝙蝠到人可能还存在更多的中间宿主，目前还没有确认。</div>
                           <div>&nbsp;&nbsp;&nbsp;&nbsp;冠状病毒由动物到人、人与人的路径：接触传播和飞沫传播。</div>
                           <img src='../../static/img/dwdr.jpg'>`
                }, {
                    "name": "哪些冠状病毒\n可以引起人类的肺炎",
                    "symbolSize": 10,
                    "category": '冠状病毒',
                    "id": `&nbsp;&nbsp;&nbsp;&nbsp;HKU1、SARS-CoV、MERS-CoV、2019-nCoV可引起人类肺炎。`
                }, {
                    "name": "冠状病毒的抵抗力",
                    "symbolSize": 10,
                    "category": '冠状病毒',
                    "id": `<div>&nbsp;&nbsp;&nbsp;&nbsp;冠状病毒对紫外线和热敏感，56℃30分钟、乙醚、75%酒精、含氯消毒剂、过氧乙酸和氯仿等脂溶剂均可有效灭活病毒。氯己定不能有效灭活病毒。</div>
                           <img src='../../static/img/dkl.jpg'>`
                }, {
                    "name": "冠状病毒的致病性",
                    "symbolSize": 10,
                    "category": '冠状病毒',
                    "id": `<img src='../../static/img/zbx.jpg'>
                           <div>&nbsp;&nbsp;&nbsp;&nbsp;新型冠状病毒是一种发生抗原变异的冠状病毒。该病毒潜伏期一般为3～7天，最长不超过14天。</div>
                           <div>&nbsp;&nbsp;&nbsp;&nbsp;衡量一种病毒的危害程度，一看致死率，二看传染性，与SARS相比，2019-nCoV在这两方面暂时比较温和。新型冠状病毒已具备致死性，尚不能确定致死率，但其高危性或许低于SARS冠状病毒，目前处于研究观察阶段。</div>`
                }, {
                    "name": "冠状病毒的免疫力",
                    "symbolSize": 10,
                    "category": '冠状病毒',
                    "id": `<div>&nbsp;&nbsp;&nbsp;&nbsp;关于病人病后体内产生保护性免疫抗体的水平、抗体持续的时间，仍然缺少科学数据，因此，暂不能确定病人病后能否防御同型病毒的再感染。</div>
                          <img src='../../static/img/myl.jpg'>`
                }, {
                    "name": "社区获得性肺炎",
                    "symbolSize": 10,
                    "category": '传播风险',
                    "id": `<div>&nbsp;&nbsp;&nbsp;&nbsp;社区获得性肺炎（community acquired pneumonia，CAP）指在医院外罹患的感染性肺实质炎症（含肺泡壁，即广义上的肺间质），包括具有明确潜伏期的病原体感染而在入院后平均潜伏期内发病的肺炎。</div>
                           <img src='../../static/img/sqhdxfy.jpg'>`
                }, {
                    "name": "社区获得性肺炎\n临床诊断标准",
                    "symbolSize": 10,
                    "category": '传播风险',
                    "id": `<div>（1）社区发病。
                            <br>
                           （2）肺炎相关临床表现如下。
                            <br>
                            &nbsp;&nbsp;◎新近出现的咳嗽、咳痰或原有呼吸道疾病加重，伴或不伴脓痰/胸痛/呼吸困难/咯血。
                            <br>
                            &nbsp;&nbsp;◎发热。
                            <br>
                            &nbsp;&nbsp;◎肺实变体征和（或）闻及湿性啰音。
                            <br>
                            &nbsp;&nbsp;◎WBC（白细胞）高于10×109/L或低于4×109/L，伴或不伴中性粒细胞核左移。
                            <br>
                           （3）影像学：胸部X线检查显示新出现的斑片状浸润性阴影、叶/段实变影，或间质性改变，伴或不伴胸腔积液。（2）中的任何一项加影像学检查结果，排除非感染性疾病可做出诊断。</div>
                           <img src='../../static/img/zdbz1.jpg'>
                           <img src='../../static/img/zdbz2.jpg'>`
                }, {
                    "name": "常见的社区获得性肺炎\n病原体",
                    "symbolSize": 10,
                    "category": '传播风险',
                    "id": `<div>&nbsp;&nbsp;&nbsp;&nbsp;导致急性呼吸道疾病的最常见病原体包括细菌、病毒或者细菌-病毒混合感染、衣原体、支原体等。新型病原体（如新型冠状病毒）可导致急性呼吸道疾病流行或大流行。</div>
                           <div>&nbsp;&nbsp;&nbsp;&nbsp;细菌是导致社区获得性肺炎的主要致病原，链球菌肺炎是最常见的细菌性肺炎之一。</div>
                           <div>&nbsp;&nbsp;&nbsp;&nbsp;支原体、衣原体、流感嗜血杆菌、肺炎克雷伯菌、大肠埃希菌及金黄色葡萄球菌是常见的肺炎致病菌；铜绿假单胞菌、鲍曼不动杆菌可见少数肺炎病例。我国成人CAP病人中病毒检出率为15%～34.9%，流感病毒占首位，其他包括副流感病毒、鼻病毒、腺病毒、人偏肺病毒、呼吸道合胞病毒及冠状病毒等。病毒检测阳性病人5.8%～65.7%，可合并细菌或非典型病原体感染。</div>`
                }, {
                    "name": "社区获得性肺炎\n如何形成人际循环",
                    "symbolSize": 10,
                    "category": '传播风险',
                    "id": `<div>&nbsp;&nbsp;&nbsp;&nbsp;理论上所有导致社区获得性肺炎的病原都存在人际传递的风险。病原体从感染源传播到易感人群的路径：飞沫传播、接触传播、空气传播。</div>
                           <div>&nbsp;&nbsp;&nbsp;&nbsp;冬季受气候和人口流动（春运）等因素的影响，易发生呼吸道传染病的局部性大暴发。主要通过病人咳嗽、喷嚏等飞沫直接传播。</div>
                           <img src='../../static/img/rjxh.jpg'>`
                }, {
                    "name": "社区存在\n传播肺炎的危险因素",
                    "symbolSize": 10,
                    "category": '传播风险',
                    "id": `<div>
                        &nbsp;&nbsp;&nbsp;&nbsp;秋冬季是流感等呼吸道病毒流行的季节，各种感染都可能出现，特别是上呼吸道感染与这次新型冠状病毒肺炎早期的症状很难鉴别。
                          <br>&nbsp;&nbsp;&nbsp;&nbsp;社区获得性肺炎的感染源主要有病人、病人家属、探视者及其生活环境。
                          <br>&nbsp;&nbsp;&nbsp;&nbsp;社区获得性肺炎的分布和结局与下列因素有关：
                          <br>&nbsp;&nbsp;&nbsp;&nbsp;（1）环境状况：空气污染物、室内拥挤程度、湿度、室内卫生、季节、温度。
                          <br>&nbsp;&nbsp;&nbsp;&nbsp;（2）医疗保健服务和控制传播的预防感染措施的可及性和有效性：疫苗、卫生保健机构的可及性和隔离能力等。
                          <br>&nbsp;&nbsp;&nbsp;&nbsp;（3）宿主因素：年龄、吸烟情况、宿主的传染性大小、免疫状况、营养状况、既往感染过或伴有其他病原体感染、身体基础状况。
                          <br>&nbsp;&nbsp;&nbsp;&nbsp;（4）病原体特征：传播方式、传染力、毒力因素和微生物量（接种量）。</div>
                          <img src='../../static/img/wxys.jpg'>`
                }, {
                    "name": "社区获得性肺炎的预防",
                    "symbolSize": 10,
                    "category": '传播风险',
                    "id": `<div>&nbsp;&nbsp;&nbsp;&nbsp;传染源控制：急性呼吸道疾病病人咳嗽、打喷嚏时，用手肘或其他材料（手帕、纸巾、布口罩或者外科口罩）掩住口鼻，以减少飞沫传播。接触呼吸道分泌物后，应该立即执行手卫生，勤洗手。</div>
                           <div>&nbsp;&nbsp;&nbsp;&nbsp;个人预防：
                            <br>&nbsp;&nbsp;&nbsp;&nbsp;（1）合理膳食、保证充足营养、保持口腔健康有助于预防肺炎的发生。
                            <br>&nbsp;&nbsp;&nbsp;&nbsp;（2）适量运动，提高免疫能力。
                            <br>&nbsp;&nbsp;&nbsp;&nbsp;（3）戒烟限酒，心理平衡。
                            <br>&nbsp;&nbsp;&nbsp;&nbsp;（4）保持室内通风，可通过自然通风和/或排风扇来促进通风状况。
                            <br>&nbsp;&nbsp;&nbsp;&nbsp;（5）接种疫苗。</div>
                            <img src='../../static/img/sqhdxfyyf.jpg'>`
                }, {
                    "name": "如何居家消毒",
                    "symbolSize": 10,
                    "category": '传播风险',
                    "id": `<div>（1）酒精：酒精能使细菌的蛋白质变性凝固。消毒皮肤可使用75%医用酒精。
                               <br>（2）蒸笼：从沸腾开始20分钟即可达到消毒目的，适用于消毒餐具和衣物。
                               <br>（3）煮沸：100℃的温度也能使细菌的蛋白质变性，需要消毒杀菌的物品必须全部浸入水面。适用于消毒餐具、某些玩具、奶瓶等小件物品。
                               <br>（4）天然紫外线：天然紫外线就是太阳光，杀菌效果不容忽视。适用于消毒空气、衣物、毛绒玩具、被褥等。<div>
                               <img src='../../static/img/jjxd1.jpg'>
                               <br>（5）空气清洁：保持室内空气清洁，常通风换气是必要的，尤其在秋冬季节，别因为寒冷而忽视了通风。
                               <br>（6）高锰酸钾溶液：使用5‰高锰酸钾溶液可消毒餐具、蔬菜和水果，浸泡1分钟之后用干净饮用水再冲洗一遍即可。
                               <br>（7）漂白粉：漂白粉能使细菌的酶失去活性，导致其死亡，是非常有效的消毒杀菌法。在桌椅、床、地板、墙面等使用1%～3%漂白水（漂白粉加清水），用抹布擦拭即可达到消毒目的。
                               <br>（8）消毒液：消毒液包含氯，能有效消毒杀菌，直接稀释之后装在塑料壶即可进行消毒杀菌，但需要注意避开食物和餐具。适用于桌、椅、床、墙面、地板等。
                               <img src='../../static/img/jjxd2.jpg'>`
                }, {
                    "name": "疫情的流行病学特点",
                    "symbolSize": 10,
                    "category": '传播风险',
                    "id": `<div>&nbsp;&nbsp;&nbsp;&nbsp;早期收治病例多数有武汉市华南海鲜市场暴露史，部分病例为家庭聚集性发病。已经出现人传人和医务人员感染病例，在武汉市已明显存在社区传播。
                               <br>&nbsp;&nbsp;&nbsp;&nbsp;新型冠状病毒已具备致死性，尚不能确定致死率，但其高危性或许低于SARS病毒，但人口流动会加速传播，增加防控难度。</div>`
                }, {
                    "name": "新冠病毒的传播途径",
                    "symbolSize": 10,
                    "category": '传播风险',
                    "id": `&nbsp;&nbsp;&nbsp;&nbsp;主要传播方式是经飞沫传播、接触传播（包括手污染导致的自我接种）及不同大小的呼吸道气溶胶近距离传播。
                          <br>&nbsp;&nbsp;&nbsp;&nbsp;冠状病毒在人与人之间传播，通常是在某人接触到感染者的分泌物的时候。接触到感染者咳嗽或打喷嚏飞溅出的体液，或者和感染者握手，或手触摸感染者污染过的物品，然后又触摸自己的嘴、鼻子或眼睛，就可能感染病毒。
                          <br>&nbsp;&nbsp;&nbsp;&nbsp;正常情况下，人的肺中约有1 L体液，打喷嚏时，肺部会被挤压从而将液体呈雾状喷射到体外，液体会分成4万多个小液滴，每个小液滴包含大量的病毒和细菌。这些液滴的速度能高达35 m/s，传播距离可达3～8 m。
                          <br>&nbsp;&nbsp;&nbsp;&nbsp;前期各医院收治病例多数有武汉市华南海鲜市场暴露史，部分病例为家庭聚集性发病，医务人员感染风险高。从现在定义的急性呼吸道传染病推断，近距离飞沫传播应该是主要途径。
                          <img src='../../static/img/cbtj.jpg'>`
                }, {
                    "name": "为什么要对密切接触者\n医学观察14天",
                    "symbolSize": 10,
                    "category": '传播风险',
                    "id": `<div>&nbsp;&nbsp;&nbsp;&nbsp;目前了解新型冠状病毒的潜伏期最长时间为14天。
                           <br>&nbsp;&nbsp;&nbsp;&nbsp;对密切接触者采取较为严格的医学观察等预防性公共卫生措施十分必要，这是一种对公众健康安全负责任的态度，也是国际社会通行的做法。参考其他冠状病毒所致疾病潜伏期、此次新型冠状病毒病例相关信息和当前防控实际，将密切接触者医学观察期定为14天，并对密切接触者进行居家医学观察。</div>
                           <img src='../../static/img/yxgc14t.jpg'>`
                }, {
                    "name": "病人的临床表现",
                    "symbolSize": 10,
                    "category": '发现与治疗',
                    "id": `<div>&nbsp;&nbsp;&nbsp;&nbsp;新型冠状病毒肺炎起病以发热为主要表现，部分早期患者可以不发热，仅有畏寒和呼吸道症状，可合并轻度干咳、乏力、呼吸不畅、腹泻等症状，流涕、咳痰等症状少见。病人可逐渐出现呼吸困难，严重者病情进展迅速，数日内即可出现急性呼吸窘迫综合征、脓毒症休克、难以纠正的代谢性酸中毒和出凝血功能障碍。部分患者起病症状轻微，可无发热。多数患者预后良好，少数患者病情危重，甚至死亡。</div>'
                          <img src='../../static/img/lcbx.jpg'>`
                }, {
                    "name": "新冠肺炎的实验室检查",
                    "symbolSize": 10,
                    "category": '发现与治疗',
                    "id": `<div>&nbsp;&nbsp;&nbsp;&nbsp;新型冠状病毒可通过实时反转录聚合酶链式反应（real time reverse transcription PCR，rRT-PCR）鉴定。每个病例采集上、下呼吸道标本，如支气管或肺泡灌洗液、深咳痰液，同时采集发病初期和发病14天后的血清。发病早期白细胞总数正常或降低，淋巴细胞计数减少，部分病人出现肝酶、肌酶和肌红蛋白增高。多数病人C反应蛋白和血沉升高，降钙素原正常。严重者D-二聚体升高。</div>
                    <img src='../../static/img/sysjc.jpg'>`
                }, {
                    "name": "病人的胸部影像学特征",
                    "symbolSize": 10,
                    "category": '发现与治疗',
                    "id": `<div>&nbsp;&nbsp;&nbsp;&nbsp;早期呈现多发的小斑片影及间质改变，以肺外带明显，进而发展为双肺多发磨玻璃影、浸润影，严重者可出现肺实变，甚至“白肺”，胸腔积液少见</div>`
                }, {
                    "name": "临床识别新冠肺炎病例",
                    "symbolSize": 10,
                    "category": '发现与治疗',
                    "id": `<div>疑似病例同时符合以下2条:
                    <br>（1）流行病学史：在发病前两周内有武汉市旅行史或居住史，或发病前14天内曾经接触过来自武汉的发热伴呼吸道症状的病人，或者有聚集性发病。
                    <br>（2）临床表现：发热，部分早期病人可以不发热，仅有畏寒和呼吸道症状；具有病毒性肺炎影像学特征；发病早期白细胞总数正常或降低，或淋巴细胞计数减少。</div>
                    <img src='../../static/img/fybl.jpg'>`
                }, {
                    "name": "如何快速检测确定感染",
                    "symbolSize": 10,
                    "category": '发现与治疗',
                    "id": `<div>&nbsp;&nbsp;&nbsp;&nbsp;在符合疑似病例标准的基础上，对痰液、咽拭子、下呼吸道分泌物等标本进行rRT-PCR检测2019-nCoV核酸阳性，就可确诊。</div>`
                }, {
                    "name": "治疗应选择的场所",
                    "symbolSize": 10,
                    "category": '发现与治疗',
                    "id": `<div>&nbsp;&nbsp;&nbsp;&nbsp;应在具备有效隔离条件和防护条件的医院隔离治疗，危重病例应尽早收入ICU治疗</div>
                    <img src='../../static/img/zlcs.jpg'>`
                }, {
                    "name": "运送病人的转运原则",
                    "symbolSize": 10,
                    "category": '发现与治疗',
                    "id": `<div>&nbsp;&nbsp;&nbsp;&nbsp;运送病人应使用专用车辆，并做好运送人员的个人防护和车辆消毒。</div>
                    <img src='../../static/img/zyyz.jpg'>`
                }, {
                    "name": "新冠肺炎如何治疗",
                    "symbolSize": 10,
                    "category": '发现与治疗',
                    "id": `<div>（1）卧床休息、加强支持治疗，注意水、电解质平衡，维持内环境稳定，密切监测生命体征、指氧饱和度等。
                    <br>（2）根据病情监测血常规、尿常规、C反应蛋白（CRP）、生化指标（肝酶、心肌酶、肾功能等）、凝血功能，必要时进行动脉血气分析，复查胸部影像学。
                    <br>（3）根据氧饱和度的变化，及时给予有效氧疗措施，包括鼻导管、面罩给氧，必要时经鼻高流量氧疗、无创或有创机械通气等。
                    <br>（4）抗病毒治疗：目前无有效抗病毒药物。
                    <br>（5）抗菌药物治疗：加强细菌学监测，有继发细菌感染证据时及时应用抗菌药物。
                    <br>（6）中医药治疗：根据证候辨证施治。</div>
                    <img src='../../static/img/sysjc.jpg'>`
                }, {
                    "name": "临床解除隔离和出院的标准",
                    "symbolSize": 10,
                    "category": '发现与治疗',
                    "id": `<div>（1）病情稳定，发热情况好转。
                    <br>（2）肺部影像学明显好转，没有脏器功能障碍。
                    <br>（3）病人呼吸平稳，意识清楚，交流正常，饮食正常，体温恢复正常3天以上，呼吸道症状明显好转，连续两次呼吸道病原核酸检测阴性（间隔至少1天）。</div>
                    <img src='../../static/img/zyyz.jpg'>`
                }, {
                    "name": "新冠肺炎的保护远离",
                    "symbolSize": 10,
                    "category": '个人防护措施',
                    "id": `
                    （1）冠状病毒以飞沫传播为主，正确佩戴医用外科口罩。
                    <br>（2）打喷嚏或者咳嗽时不要用手直接遮挡。
                    <br>（3）正确、及时洗手。
                    <br>（4）提高免疫力，尽量少去人多且封闭的场所。加强锻炼、规律作息，提高自身免疫力是避免被感染的最重要手段。
                    <br>一定要戴口罩！！！就算接触到了感染者，戴口罩可以阻拦你直接吸入飞沫里的病毒。
                    <br>一定要勤洗手！！！就算手上遗留了病毒，洗手可以阻断病毒通过手由口鼻进入呼吸道引起感染</div>
                    <div><img src='../../static/img/bhyl.jpg'>`
                }, {
                    "name": "口罩的类型",
                    "symbolSize": 10,
                    "category": '个人防护措施',
                    "id": `<div>（1）纸口罩。
                        <br>（2）活性炭口罩。
                        <br>（3）棉布口罩。
                        <br>（4）海绵口罩。
                        <br>（5）医用外科口罩。
                        <br>（6）N95口罩。</div>
                    <img src='../../static/img/kzlx.jpg'>`
                }, {
                    "name": "不同类型口罩的特点",
                    "symbolSize": 10,
                    "category": '个人防护措施',
                    "id": `<div>&nbsp;&nbsp;&nbsp;&nbsp;N95口罩：能过滤95%0.3 μm颗粒，对病毒有阻隔作用。用于经空气传播的疾病。
                        <br>&nbsp;&nbsp;&nbsp;&nbsp;一次性医用外科口罩：分三层：外层有隔水层，可防止飞沫进入口罩里面；中层则有过滤层，可阻隔90%的5 μm的颗粒；近口鼻的内层用于吸湿。
                        <br>&nbsp;&nbsp;&nbsp;&nbsp;棉布口罩：口罩防病毒效率低，并且厚重、闷热、与面部密合性差。</div>
                    <img src='../../static/img/n95kz.jpg'>
                    <img src='../../static/img/mbkz.jpg'>
                    <img src='../../static/img/ycxwkkz.jpg'>`
                }, {
                    "name": "口罩KN95和N95的区别",
                    "symbolSize": 10,
                    "category": '个人防护措施',
                    "id": `<div>&nbsp;&nbsp;&nbsp;&nbsp;N95口罩其实属于呼吸器（respirator），呼吸器是一种呼吸防护设备，在设计上相较于普通口罩来说贴合面部更加紧密，可以非常有效地过滤空气中的颗粒物。其中，N表示not resistant to oil，可以用于防护非油性悬浮颗粒；95的意思是过滤效率大于等于95%，表明经过仔细测试后，这种呼吸器可以阻挡至少95%的非常小的（0.3 μm级别）测试颗粒。
                        <br>&nbsp;&nbsp;&nbsp;&nbsp;如果佩戴正确，N95的过滤能力是要优于普通口罩和医用口罩的。但是，即使佩戴完全符合要求，也无法100%消除感染疾病或死亡的风险。
                        <br>&nbsp;&nbsp;&nbsp;&nbsp;KN95是中国标准GB 2626—2006中规定的级别之一。
                        <br>&nbsp;&nbsp;&nbsp;&nbsp;N95是美国标准42 CFR 84中规定的级别之一。
                        <br>&nbsp;&nbsp;&nbsp;&nbsp;这两个级别的技术要求、测试方法等基本一致，都是对应标准下过滤效率达到95%。</div>`
                }, {
                    "name": "口罩的正确使用",
                    "symbolSize": 10,
                    "category": '个人防护措施',
                    "id": `<div>医用口罩的使用方法：
                        <br>（1）不管是一次性口罩，还是医用口罩，其实都是有正反面的，就拿一次性口罩来说，颜色深的是正面，正面应该朝外，而且医用口罩上还有鼻夹金属条。
                        <br>（2）正对脸部的应该是医用口罩的反面，也就是颜色比较浅的一面，除此之外，要注意带有金属条的部分应该在口罩的上方，不要戴反了。
                        <br>（3）分清楚口罩的正面、反面、上端、下端后，先将手洗干净，确定口罩是否正确之后，将两端的绳子挂在耳朵上。
                        <br>（4）最后一步，也是前面提到过的金属条问题，将口罩佩戴完毕后，需要用双手压紧鼻梁两侧的金属条，使口罩上端紧贴鼻梁，然后向下拉伸口罩，使口罩不留有褶皱，最好覆盖住鼻子和嘴巴。一定要贴合面部，形成密闭的环境，让通气经过口罩而不是四周的缝隙。</div>
                        <img src='../../static/img/kzsy.jpg'>`
                }, {
                    "name": "口罩的使用期限",
                    "symbolSize": 10,
                    "category": '个人防护措施',
                    "id": `<div>&nbsp;&nbsp;&nbsp;&nbsp;新型冠状病毒在人与人之间传播，通常是在人接触到感染者的分泌物的时候。不管是哪种类型的口罩，防护效果都是有限的，需定期更换。当出现以下情况时，应及时更换口罩：呼吸阻抗明显增加时；口罩有破损时；口罩与面部无法密合时；口罩受污染（如染有血渍或飞沫等异物）；曾使用与隔离病房或与病患接触（该口罩已被污染）。
                    <br> &nbsp;&nbsp;&nbsp;&nbsp;目前，国外包括世界卫生组织对N95口罩的最佳佩戴时间没有明确结论，我国也尚未对口罩的使用时间做出相关规定。对N95口罩防护效率及佩戴时间的研究结果显示，N95口罩佩戴2天，过滤效率仍保持在95%以上，呼吸阻抗变化不大；佩戴3天过滤效率降低至94.7%。美国疾病控制与预防中心建议：在N95口罩供应不充足的情况下，只要没有被明显弄脏或损坏（如折痕或撕裂），可以考虑重新使用。</div>
                    <img src='../../static/img/kzsyqx.jpg'>
                    <img src='../../static/img/kzsyqx.jpg'>`
                }, {
                    "name": "口罩的选择",
                    "symbolSize": 10,
                    "category": '个人防护措施',
                    "id": `<div>&nbsp;&nbsp;&nbsp;&nbsp;按照对佩戴者自身的防护能力优先级排名（从高到低）：N95口罩＞医用外科口罩＞普通医用口罩＞普通棉口罩。
                    <br>&nbsp;&nbsp;&nbsp;&nbsp;N95分为有、无呼气阀两种。患有慢性呼吸疾病、心脏病或其他伴有呼吸困难症状的人，使用N95口罩可能会使呼吸更加困难，因此使用配有呼气阀的N95口罩，能让呼气轻松一些，并有助于减少热量积聚。有没有呼气阀都不影响对佩戴者的保护。简单地理解，有呼气阀的N95口罩可以保护佩戴者，但不保护周围的人。病毒携带者应选用没有呼气阀的N95口罩，以免传播病毒。如果要维护无菌环境，也不能使用有呼气阀的N95口罩，因为佩戴者可能会呼出细菌或病毒。</div>`
                }, {
                    "name": "洗手在预防疾病传播的作用",
                    "symbolSize": 10,
                    "category": '个人防护措施',
                    "id": `<div>&nbsp;&nbsp;&nbsp;&nbsp;手部接触所涉及的传播途径包括经水/食物传播、血液/血制品传播、空气飞沫传播、消化道传播、直接或间接接触传播等。研究表明，正确洗手是预防腹泻和呼吸道感染的最有效措施之一。</div>
                    <img src='../../static/img/xsyf.jpg'>`
                }, {
                    "name": "正确洗手的步骤",
                    "symbolSize": 10,
                    "category": '个人防护措施',
                    "id": `<div>&nbsp;&nbsp;&nbsp;&nbsp;第一步：双手手心相互搓洗（双手合十搓5下）。
                        <br>&nbsp;&nbsp;&nbsp;&nbsp;第二步：双手交叉搓洗手指缝（手心对手背，双手交叉相叠，左右手交换各搓洗5下）。
                        <br>&nbsp;&nbsp;&nbsp;&nbsp;第三步：手心对手心搓洗手指缝（手心相对十指交错，搓洗5下）。</div>
                    <img src='../../static/img/xsbz.jpg'>
                    <div>&nbsp;&nbsp;&nbsp;&nbsp;第四步：指尖搓洗手心，左右手相同（指尖放于手心相互搓洗）。
                        <br>&nbsp;&nbsp;&nbsp;&nbsp;第五步：一只手握住另一只手的拇指搓洗，左右手相同。
                        <br>&nbsp;&nbsp;&nbsp;&nbsp;第六步：指尖摩擦掌心或一只手握住另一只手的手腕转动搓洗，左右手相同。。</div>
                    <img src='../../static/img/xsbz1.jpg'>`
                }, {
                    "name": "疑似病人的居家隔离",
                    "symbolSize": 10,
                    "category": '个人防护措施',
                    "id": `<div>（1）将病人安置在通风良好的单人房间。
                    <br>（2）限制病人看护人数，理想状况是安排一位身体健康状况良好且没有慢性疾病的人进行护理。拒绝一切探访。</div>
                    <img src='../../static/img/ysjjgl.jpg'>
                    <div>（3）家庭成员应住在不同房间，如条件不允许，和病人至少保持1 m距离。哺乳期母亲可继续母乳喂养婴儿。
                        <br>（4）限制病人活动，最小化病人和家庭成员共享区域。确保共享区域（厨房、浴室等）通风良好（保持窗户开启）。
                        <br>（5）与病人共处一室戴好口罩，口罩紧贴面部，禁止触碰和调整。口罩变湿、变脏，必须立即更换。摘下口罩后，清洗双手。
                        <br>（6）与病人有任何直接接触或进入病人隔离空间后，进行双手清洗。同样，在准备食物前后、吃饭前、如厕后及双手看起来脏的时候，也应进行双手清洁。如果双手不是肉眼可见的脏，可用手部皮肤消毒液清洁；如双手肉眼有可见的脏，则使用肥皂和清水清洗。
                        <br>（7）使用肥皂和清水洗手时，最好使用一次性擦手纸。如果没有，用洁净的毛巾擦拭，毛巾变湿时需要更换。
                        <br>（8）保护好呼吸道卫生（咳嗽、打喷嚏时，戴医用口罩、棉布口罩或用纸巾及弯曲的手肘掩护，咳嗽和打喷嚏后立即进行手的清洁）。
                        <br>（9）消毒处理后丢弃用来捂住口鼻的材料，或者使用之后正确清洗（如用普通的肥皂/洗涤剂和清水清洗手帕）。</div>
                    <img src='../../static/img/ysjjgl1.jpg'>
                    <div>（10）避免直接接触人体分泌物，特别是口部或呼吸道分泌物，以及避免直接接触病人粪便。
                        <br>（11）使用一次性手套为病人进行口部及呼吸道看护、处理粪便及尿液，不要随意丢弃。
                        <br>（12）避免和病人或被病人污染的物品接触，如牙刷、餐具、饭菜、饮料、毛巾、浴巾、床单等。餐具用后用洗涤剂清洗或直接丢弃。
                        <br>（13）使用含有稀释漂白剂（漂白剂∶水=1∶99）的普通家用消毒剂（大部分家用漂白剂含有5%的次氯酸钠）每天频繁清洁、消毒经常触碰的物品，如床头柜、床架及其他卧室家具。至少每天清洁、消毒浴室和厕所表面一次。
                        <br>（14）使用普通洗衣皂和清水清洗病人衣物、床单、浴巾、毛巾等，或者用洗衣机以60～90℃和普通家用洗衣液清洗，然后完全干燥上述物品。将污染的床品放入洗衣袋。不要甩动污染衣物，避免直接接触皮肤和自己的衣服。
                        <br>（15）戴好一次性手套和保护性衣物（如塑料围裙）再去清洁和触碰被人体分泌物污染的物体表面、衣物或床品。戴手套前、脱手套后要进行双手清洁。</div>
                    <img src='../../static/img/ysjjgl2.jpg'>
                    <div>（16）有症状的病人在症状消失之前都应待在家里，症状消失与否需要通过临床和/或实验室诊断（两次rRT-PCR检验阴性结果应间隔至少24小时）。</div>`
                }, {
                    "name": "旅行中新冠病毒的预防",
                    "symbolSize": 10,
                    "category": '个人防护措施',
                    "id": `<div>&nbsp;&nbsp;&nbsp;&nbsp;节假日是旅游的人口流动高峰期，人群间会发生不可避免的密切接触，对新型冠状病毒的预防和控制带来很大的挑战。
                    <br>（1）关注出行地的天气，并根据气候变化，注意增减衣物，防寒保暖。</div>
                    <img src='../../static/img/lxyf.jpg'>
                    <div>（2）旅游坐车、乘机途中要佩戴口罩，同时多喝水。
                        <br>（3）旅行期间保持作息规律，均衡饮食，加强运动，提高免疫力。
                        <br>（4）外出期间应尽量缩短在人群密集场所的逗留时间，或佩戴口罩出行。
                        <br>（5）家里来客人或者到公共场所，多使用一次性用品，避免交叉感染。比如家里来客人，准备一次性拖鞋；饮水时，多使用一次性纸杯；去公共浴室，自己携带毛巾等。
                        <br>（6）尽量少接触野生动物或流浪猫狗。
                        <br>（7）不能食用生肉片或未烹饪熟的肉食，因为高温可以有效地杀死食物中的病毒。
                        <br>（8）若发生身体不适应立即就医，切勿带病旅行。</div>`
                }, {
                    "name": "面对新冠肺炎\n的个人心理调节",
                    "symbolSize": 10,
                    "category": '个人防护措施',
                    "id": `<div>&nbsp;&nbsp;&nbsp;&nbsp;在预防新型冠状病毒肺炎时，增强个人心理免疫力同样重要。《长江日报》刊登的武汉大学人民医院精神卫生中心心理专家杨灿建议的“心理处方”如下：
                    <br>（1）维持正常、规律和健康的生活作息。正常、规律和健康的生活作息非常重要，适当休息，尽量保持生活的稳定性。合理安排饮食，多喝水，保证新鲜水果、蔬菜摄入，将肉、蛋、鱼、奶等动物性食物加热熟透，同时保持适度合理的适合体质的居家锻炼。
                    <br>（2）少刷手机。信息网络、自媒体普及，消息层出不穷，各种真假消息让人无所适从，徒然增加自己的焦虑恐慌情绪，影响自己的心情。要学会放一放，可以每天定时查看手机新闻，而不是每分每秒都在刷屏。</div>
                    <img src='../../static/img/xltj.jpg'>
                    <div>（3）充实生活，转移注意力，不让自己太闲。适度选择家中的娱乐活动，如玩一些不费脑的小游戏，多运动，深呼吸，抱抱可以慰藉你的物体，泡泡热水澡或冲澡，甚至做做家务，将家里装扮出新年的气氛，和朋友、家人聊天。总之，找出可以转移注意力或者让自己愉悦的事来做。
                        <br>（4）正视并接纳自己的焦虑恐惧情绪。面对未知的病毒，我们很难做到淡定。新型冠状病毒是全新的病毒，存在很大的不确定性，会让很多人感到病毒“无处不在”，难以预防，有此焦虑乃正常情绪反应。但不要觉得自己太脆弱、意志力不够坚定等。允许自己哭一哭，允许自己有这样的情绪，不要严苛要求自己。
                        <br>（5）正视身体发出的信号。当人类处于应激状态时，身体自然会出现一些反应。比如睡不着觉、吃不下饭、记忆力下降、注意力不集中、身体没有力气、精力不佳；或者看到网络上介绍的疾病症状，由于心理暗示，也会感到咽干、咽痛、胸闷、头昏、呼吸不畅等等。首先要告诉自己情绪不好、恐惧害怕焦虑担心时，就是会有某些不舒服；其次正常作息、规律生活、适量运动、转移注意力等等。如果症状持续并严重到影响自己的生活，需要到医院就诊，由医生评估并制订治疗方案。</div>`
                }, {
                    "name": "农贸市场的预防传染",
                    "symbolSize": 10,
                    "category": '场所卫生要求',
                    "id": `<div>（1）避免在未加防护的情况下与牲畜或野生动物接触。
                        <br>（2）在人多的地方戴口罩。
                        <br>（3）咳嗽或打喷嚏时，用纸巾或袖或屈肘将鼻完全遮住；将用过的纸巾立刻扔进封闭式垃圾箱内；咳嗽或打喷嚏后，用肥皂和清水或含酒精洗手液清洗双手。
                        <br>（4）回家后及时洗手，如有发热和其他呼吸道感染症状，特别是持续发热不退，及时到医院就诊</div>
                    <img src='../../static/img/nmyf.jpg'>`
                }, {
                    "name": "影剧院的预防传染",
                    "symbolSize": 10,
                    "category": '场所卫生要求',
                    "id": `<div>&nbsp;&nbsp;&nbsp;&nbsp;传染病流行期间，尽量不到影剧院等人群密集和空气流通不畅的公共场所。如必须去应戴口罩，在自己咳嗽或打喷嚏时，用纸巾将口鼻完全遮住，并将用过的纸巾立刻扔进封闭式垃圾箱内，防止病毒传播。影剧院等公共场所经营管理者应保持室内环境卫生，每日定时换气通风，清洁消毒。</div>
                    <img src='../../static/img/yjjyfcr.jpg'>`
                }, {
                    "name": "公共交通设施的预防传染",
                    "symbolSize": 10,
                    "category": '场所卫生要求',
                    "id": `<div>&nbsp;&nbsp;&nbsp;&nbsp;公交车、地铁、轮船和飞机等地方都人流密集，可佩戴口罩减少接触病原风险。在自己咳嗽或打喷嚏时，用纸巾将口鼻完全遮住，并将用过的纸巾立刻扔进封闭式垃圾箱内，防止病原传播。</div>
                    <img src='../../static/img/ggssyf.jpg'>`
                }, {
                    "name": "办公室的预防传染",
                    "symbolSize": 10,
                    "category": '场所卫生要求',
                    "id": `<div>&nbsp;&nbsp;&nbsp;&nbsp;保持工作场所室内不断地通风换气；不要随地吐痰，可以先吐在纸张上，在方便时再把它扔进封闭式垃圾箱内，在自己咳嗽或打喷嚏时，用纸巾将口鼻完全遮住，并将用过的纸巾立刻扔进封闭式垃圾箱内，防止病原体传播；保持个人卫生，要勤洗手；传染病流行季节应尽量避免各类聚会。</div>
                    <img src='../../static/img/bgcsyf.jpg'>`
                }, {
                    "name": "医院的预防传染",
                    "symbolSize": 10,
                    "category": '场所卫生要求',
                    "id": `<div>（1）去医院看病、探望病人时，尤其是去医院的发热门诊或呼吸科就诊时应该戴上口罩。
                        <br>（2）尽可能避免与有呼吸道疾病症状（如发热、咳嗽或打喷嚏等）的人密切接触。
                        <br>（3）保持良好的个人卫生习惯，咳嗽或打喷嚏时用纸巾掩住口鼻。
                        <br>（4）用肥皂和清水或含酒精洗手液清洗双手，不用脏手触摸眼睛、鼻或口。
                        <br>（5）将用过的纸巾立刻扔进封闭式垃圾箱内。
                        <br>（6）密切关注发热、咳嗽等症状，出现此类症状一定要及时就近就医。</div>
                    <img src='../../static/img/yyyfcr.jpg'>`
                }, {
                    "name": "医务人员个人防护",
                    "symbolSize": 10,
                    "category": '场所卫生要求',
                    "id": `<div>（1）医务人员在诊疗工作中应当遵循标准预防原则，严格执行手卫生、消毒、隔离及个人防护等措施。
                        <br>（2）在接触病人时应当戴外科口罩。戴口罩前和摘口罩后应当进行洗手或卫生手消毒。
                        <br>（3）医务人员进入或者离开发热门（急）诊时，要按照有关要求，正确穿脱防护用具。</div>`
                }, {
                    "name": "发热门诊的医务人员防护服",
                    "symbolSize": 10,
                    "category": '场所卫生要求',
                    "id": `<div>（1）医务人员是疫情防控的主力军。医务人员做好个人的防护，才能更好地救助广大病人。
                        <br>（2）为确保医务人员健康，应加强各类医院的防控措施，严格控制医院感染，强化医务人员防护，关心关爱医务人员，加强对医务人员健康的日常监测，才能有效对疑似病例及时进行检测和救治。</div>
                    <img src='../../static/img/fhfjz.jpg'>`
                }, {
                    "name": "个人防护用品的配备",
                    "symbolSize": 10,
                    "category": '场所卫生要求',
                    "id": `<div>（医疗机构相关科室（部门）应按规定配备：一次性工作帽、一次性外科口罩、防护眼镜（防雾型）、工作服（白大褂）、防护服、一次性乳胶手套、一次性鞋套和全面型呼吸防护器或正压式头套等。</div>`
                }, {
                    "name": "法定传染病和检疫传染病",
                    "symbolSize": 10,
                    "category": '传染病相关知识',
                    "id": `<div>&nbsp;&nbsp;&nbsp;&nbsp;有些传染病，疾病控制机构必须及时掌握其发病情况，采取对策，因此发现后相关责任人和机构须按规定时间及时向当地疾病控制机构报告，称为法定传染病。
                    <br>&nbsp;&nbsp;&nbsp;&nbsp;检疫传染病是指传染性强、病死率高的传染病，如鼠疫、霍乱、黄热病等。根据《中华人民共和国传染病防治法》的相关规定，基于目前对新型冠状病毒感染的肺炎的病原、流行病学、临床特征等特点认识，将新型冠状病毒感染的肺炎纳入检疫传染病管理，通过对口岸及各类关口、运输环节等的管控，达到控制疾病通过人、动物及物品等传播的目的。</div>
                    <img src='../../static/img/fdcrb.jpg'>`
                }, {
                    "name": "传染病的防治方针和原则",
                    "symbolSize": 10,
                    "category": '传染病相关知识',
                    "id": `<div>&nbsp;&nbsp;&nbsp;&nbsp;国家对传染病防治实行预防为主的方针，防治结合、分类管理、依靠科学、依靠群众的原则。</div>`
                }, {
                    "name": "新冠肺炎纳入乙类传染病\n按甲类管理",
                    "symbolSize": 10,
                    "category": '传染病相关知识',
                    "id": `<div>（1）新型冠状病毒肺炎暂且还没有严重到甲类传染病（鼠疫和霍乱）的水平，但是公共卫生风险比较大，需要每个人保持足够的警惕，做好防护。
                    <br>（2）升级为甲类管理后，上报和公布速度会更快。既方便医疗人员对疾病的防控，也方便大众了解最新情况，及时应对。</div>
                    <img src='../../static/img/flgl.jpg'>`
                }, {
                    "name": "超级传播者",
                    "symbolSize": 10,
                    "category": '传染病相关知识',
                    "id": `<div>&nbsp;&nbsp;&nbsp;&nbsp;某一感染者体内的病毒出现变异或者适应人体的情况，导致该病毒的传播能力强，进而令该病人可传染很多的密切接触者，这样的病人就被称为超级传播者。在感染人数上，如果感染人数超过3个，就可以考虑在超级传播者的范围内；如果感染人数超过10个，就应该是比较确切的超级传播者。
                    <br>&nbsp;&nbsp;&nbsp;&nbsp;2020年1月22日，中国科学院院士、中国疾病预防控制中心主任高福在国新办发布会上表示，还没有证据证明已经出现新型冠状病毒超级传播者。高福表示，对新型冠状病毒处于不断认知的过程中，采取的防控措施是理论指导下的防控措施，将特别关注可能出现的超级传播者。</div>
                    <img src='../../static/img/cjcbz.jpg'>`
                }, {
                    "name": "超级传播者的特点",
                    "symbolSize": 10,
                    "category": '传染病相关知识',
                    "id": `<div>超级传播者具有以下特点。
                        <br>（1）高龄体质弱者。
                        <br>（2）存在其他基础疾病。
                        <br>他们为数不多，但传染性较强，是疫情的主要传播者。</div>
                    <img src='../../static/img/nmyf.jpg'>`
                }, {
                    "name": "‘毒王’",
                    "symbolSize": 10,
                    "category": '传染病相关知识',
                    "id": `<div>&nbsp;&nbsp;&nbsp;&nbsp;超级传播者也可以被称为“毒王”，“毒王”的第二层含义是传播者感染的病例通常出现重症，甚至多有死亡，“毒王”是病毒变异后感染力和致病性增强的结果。</div>`
                }, {
                    "name": "隔离医学观察",
                    "symbolSize": 10,
                    "category": '传染病相关知识',
                    "id": `<div>&nbsp;&nbsp;&nbsp;&nbsp;《中华人民共和国传染病防治法》规定，对“传染病病人”和“疑似传染病病人”的密切接触者，要在指定场所进行医学观察或采取其他预防措施。
                        <br>密切接触者的主要管理措施包括：
                        <br>（1）登记并进行7～14天医学观察。
                        <br>（2）尽量减少外出活动。
                        <br>（3）疾控机构负责对密切接触者进行随访，每日测量体温和进行健康询问，做好登记。</div>`
                }, ]
            };
            var categories = [{
                name: '传播风险',
                itemStyle: {
                    color: 'orange'
                }
            }, {
                name: '冠状病毒',
                itemStyle: {
                    color: 'tomato'
                }
            }, {
                name: '发现与治疗',
                itemStyle: {
                    color: 'lightgreen'
                }
            }, {
                name: '个人防护措施',
                itemStyle: {
                    color: '#1ea4ec'
                }
            }, {
                name: '场所卫生要求',
                itemStyle: {
                    color: 'yellow'
                }
            }, {
                name: '传染病相关知识',
                itemStyle: {
                    color: 'pink'
                }
            }];
            let option = {
                animationDurationUpdate: 1500,
                animationEasingUpdate: 'quinticInOut',
                legend: [{
                    top: 'center',
                    left: 150,
                    orient: 'vertical',
                    textStyle: {
                        color: "white"
                    },
                    data: categories.map(function(a) {
                        return a.name;
                    })
                }],
                series: [{
                    name: "relation",
                    type: 'graph',
                    layout: 'circular',
                    zoom: 0.8,
                    layoutSize: 70,
                    circular: {
                        rotateLabel: true
                    },
                    data: graph.nodes.map(item => {
                        return {
                            id: item.id,
                            name: item.name,
                            symbolSize: item.symbolSize,
                            category: item.category
                        }
                    }),
                    links: graph.links,
                    categories: categories,
                    roam: true,
                    label: {
                        fontSize: 10,
                        show: true,
                        position: 'right',
                        formatter: '{b}',
                        interval: 0
                    },
                    itemStyle: {
                        color: "#4ad8c3"
                    },
                    emphasis: {
                        lineStyle: {
                            width: "3"
                        }
                    },
                    focusNodeAdjacency: true,
                    lineStyle: {
                        color: new echarts.graphic.LinearGradient(0, 0, 0, 1, [{
                            offset: 0,
                            color: '#4e8ebf'
                        }, {
                            offset: 0.45,
                            color: '#9ac8e0'
                        }, {
                            offset: 0.65,
                            color: '#ba3036'
                        }, {
                            offset: 1,
                            color: '#c84641'
                        }]),
                        curveness: 0.3
                    }
                }]
            };
            let myChart1 = echarts.init(document.getElementById('myChart-map3'));
            myChart1.setOption(option);
            myChart1.on('click', function(node) {
                document.querySelector('.screen .ml').innerHTML = node.data.name;
                document.querySelector('.screen .content').innerHTML = node.data.id;
            })
        }

    }
</script>
<style>
    #myChart-map3 {
        position: absolute;
        height: 100%;
        width: 100%;
        left: 0;
        top: 0;
        background: var(--bg-darkColor);
    }
    
    .bg {
        position: absolute;
        width: 300px;
    }
    
    .mobile-show {
        position: absolute;
        width: 350px;
        height: 600px;
        background: linear-gradient(45deg, #3ca898, #607dc4);
        top: 50%;
        right: 20px;
        margin-top: -280px;
        border-radius: 2.5rem;
        box-shadow: 0 0 4px 0px rgb(111, 111, 111);
    }
    
    .top-hr {
        position: absolute;
        background: #d0d0d0;
        height: 1vw;
        width: 8vw;
        border-radius: 5vw;
        margin-right: 0.3vw;
        left: 50%;
        top: 20px;
        margin-left: -5vw;
    }
    
    .top-dot {
        position: absolute;
        display: inline-block;
        background: #d0d0d0;
        height: 1vw;
        width: 1vw;
        border-radius: 50%;
        left: 50%;
        top: 20px;
        margin-left: 4vw;
    }
    
    .screen {
        position: absolute;
        height: 500px;
        width: 300px;
        background: rgba(255, 255, 255, 0.651);
        bottom: 40px;
        left: 25px;
        border-radius: 10px;
        overflow-y: scroll;
        border: 2px solid rgba(255, 255, 255, 0.178);
    }
    
    .screen .catalogue {
        background: var(--bg-darkColor);
        padding-bottom: 40px;
    }
    
    .screen p {
        background: #fff;
        padding: 10px;
        text-align: left;
        color: #333;
    }
    
    .screen .ml {
        text-align: left;
        background: #eee;
        padding: 10px;
        color: #999;
        border-top-left-radius: 10px;
        border-top-right-radius: 10px;
        margin-top: -20px;
    }
    
    .screen::-webkit-scrollbar {
        display: none;
    }
    
    .hr {
        width: 90%;
        margin-left: 5%;
        height: 1px;
        border-radius: 10rem;
        background-color: #eee;
    }
    
    .content {
        padding: 10px;
        text-align: left;
        color: #444;
    }
    
    .content>div {
        animation-name: fadeIn;
        animation-duration: 1s;
        animation-fill-mode: both;
    }
    
    .content img {
        margin-top: 10px;
        width: 90%;
        margin-left: 5%;
        border-radius: 3px;
        animation-name: fadeInRight;
        animation-duration: 1s;
        animation-fill-mode: both;
    }
</style>